# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел A. Последняя строка содержит число X
# *Пример:*
# 5
#     1 2 3 4 5
#     3
#     -> 1
import random

# list = []
# quantity_of_list = int(input('Input quantity elements of list: '))
# numX = int(input('Input number X: '))
# count = 0

# for i in range(quantity_of_list):
#     list.append(random.randint(1, quantity_of_list))
#     if numX == list[i]:
#         count += 1

# print(list)
# print(numX)
# print(count)

# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример:*
# 5
#     1 2 3 4 5
#     6
#     -> 5

# list = []
# quantity_of_list = int(input('Input quantity elements of list: '))
# numX = int(input('Input number X: '))
# result = 1

# for i in range(quantity_of_list):
#     list.append(random.randint(1, quantity_of_list))
#     if list[i] < numX and list[i] > result:
#         result = list[i]

# print(list)
# print(numX)
# print(result)
