# Создание списков
# my_list = [1, -5.4, 'hello', [1, 2, 4]]
# my_list = list()
# print(my_list)
# for elem in my_list:
#     print(elem)
# for i in range(4):
#     print(my_list[i])
#     if my_list[i] == 'Hello':
#         print('Hello')
# print(my_list[0])
# print(max(my_list)) # найдет максимум в списке
# print(min(my_list)) # найдет минимум в списке
# print(sum(my_list)) # найдет сумму эл-в в списке
# print(len(my_list)) # найдет длину списка
# my_list = [1, 2, 3, 4, 5, 6, 9 , 10]
# my_list.pop(0) # удалит элемент
# first_el = my_list.pop(0) # запишет его в переменную
# Срезы
# my_list_2 = my_list[4:6]
# my_list_2 = my_list[4:]
# my_list_2 = my_list[:6]
# my_list_2 = my_list[0::2]
# my_list_2 = my_list.copy()
# print(my_list_2)

# Создание кортежа
# a = (1, 3, 6)
# print(type(a))

# Словари
# my_dict = {'dog': 'собака', 'cat': 'кошка'}
# my_dict = dict()
# my_dict['dog'] = 'собака'
# my_dict['cat'] = 'кошка'
# print(my_dict)
# print(my_dict['dog'])
# for i in my_dict:
#     print(i, my_dict[i])
# for item in my_dict:
#     print('{}: {}'.format(item, my_dict[item]))
# for key, value in my_dict.items():
#     print(key, value)

# Задача №17. Общее обсуждение
# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6
# Примечание: Пользователь может вводить значения
# списка или список задан изначально.

# list = [1, 2, 3, 4, 5]
# print(type(list))

# Задача №19. Решение в группах
# Дана последовательность из N целых чисел и число
# K. Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо, K –
# положительное число.
# Input: [1, 2, 3, 4, 5] k = 3
# Output: [4, 5, 1, 2, 3]
# Примечание: Пользователь может вводить значения
# списка или список задан изначально.

# Задача №21. Решение в группах
# Напишите программу для печати всех уникальных
# значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
# ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
# Примечание: Список словарей задан изначально.
# Пользователь его не вводит

# Задача №23. Решение в группах
# Дан массив, состоящий из целых чисел. Напишите
# программу, которая подсчитает количество
# элементов массива, больших предыдущего (элемента
# с предыдущим номером)
# Input: [0, -1, 5, 2, 3]
# Output: 2 (-1 < 5, 2 < 3)
# Примечание: Пользователь может вводить значения
# списка или список задан изначально.




